//------------------------------------------------------------------------------
// documentary.cpp - содержит функции обработки данных документального фильма
//------------------------------------------------------------------------------

#include "documentary.h";

//------------------------------------------------------------------------------
// Ввод данных документального фильма из потока
void In(documentary& d, ifstream& ifst) {
    ifst >> d.length;
}

// Случайный ввод данных документального фильма
void InRnd(documentary& d) {
    d.length = RandomLength();
}

//------------------------------------------------------------------------------
// Вывод данных документального фильма в поток
void Out(documentary& d, ofstream& ofst) {
    ofst << "It is a documentary. Length: " << d.length << " minutes.\n";
}