//------------------------------------------------------------------------------
// gaming.cpp - содержит функции обработки данных игрового фильма
//------------------------------------------------------------------------------

#include "gaming.h";

//------------------------------------------------------------------------------
// Ввод данных документального фильма из потока
void In(gaming& g, ifstream& ifst) {
    ifst >> g.director;
}

// Случайный ввод данных документального фильма
void InRnd(gaming& g) {
    g.director = RandomName();
}

//------------------------------------------------------------------------------
// Вывод данных документального фильма в поток
void Out(gaming& g, ofstream& ofst) {
    ofst << "It is a gaming film. Director id: " << g.director << "\n";
}